//REPORT JOB ,CLASS=A,MSGCLASS=X,REGION=0M,
//  NOTIFY=&SYSUID
//* *------------------------------------------------------------------*
//*
//STEP0020 EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB  DD   DISP=SHR,DSN=HL2D.SDSNEXIT
//         DD   DISP=SHR,DSN=DSN.VD10.SDSNLOAD
//         DD   DISP=SHR,DSN=DSN.VD10.RUNLIB.LOAD
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSTSIN  DD  *
  DSN SYSTEM(HL2D)
  RUN PROGRAM(DSNTEP2)  PLAN(DSNTEP2) -
       LIB('DSN.VD10.RUNLIB.LOAD')
  END
//SYSIN    DD  *
SELECT INVENTORY.ITEMID,
       COUNT(INVORDER.CUSTOMERID) AS NUM_CUSTOMERS,
       SUM(INVORDER.TRANSACTION) AS AMT_SPENT
FROM INVENTORY
INNER JOIN INVORDER
ON INVENTORY.ITEMID = INVORDER.ITEMID
WHERE INVORDER.PURCHASE_TIME > CURRENT_TIMESTAMP - 1 DAY
GROUP BY INVENTORY.ITEMID

